xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Libs/SDCARDLIB/SDCard.c
	u32Data <<= 8;
	for (i=8; i>0; i--)
	{
		if ((u32Data ^ u32Accum) & 0x8000)
			u32Accum = (u32Accum << 1) ^ u32GenPoly;
		else
			u32Accum <<= 1;
		u32Data <<= 1;
	}
	return u32Accum;
}  
/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 SingleWrite                                                                               */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               UINT32 u32Data        Data to send                                                        */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               None			                                                                           */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to send data though SPI to general clock for SDCARD operation       */
/*---------------------------------------------------------------------------------------------------------*/
static uint32_t SingleWrite(uint32_t u32Data)
{
	uint32_t SPIdata=u32Data;
	SPI_SingleWrite(SPI1,&SPIdata);
    while (SPI_IsBusy(SPI1));
	SPI_DumpRxRegister(SPI1,&SPIdata,1);
	return SPIdata;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 MMC_Command_Exec		                                                                   */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               uint8_t 	nCmd          Set command register                                             */
/*               uint32_t 	nArg          Set command argument                                             */
/*               uint8_t 	*pchar        Get register and data                                            */
/*               uint32_t 	*response     Get response                                                     */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               TRUE	get response		                                                               */
/*               FALSE	1.SD Card busy, 2.Card moved, 3.Timeout	                                           */
/*					             																           */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to Send SDCARD CMD and Receive Response                             */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t MMC_Command_Exec (uint8_t nCmd, uint32_t nArg,uint8_t *pchar, uint32_t *response)
{
  	uint8_t	loopguard;
  	COMMAND current_command;      			// Local space for the command table 
  	UINT32	long_arg;               		// Local space for argument
  	static uint32_t current_blklen = 512;
  	uint32_t old_blklen = 512;     			
  	int32_t counter = 0;     				// Byte counter for multi-byte fields;
  	UINT16 card_response;           			// Variable for storing card response;
  	uint8_t data_resp;      				// Variable for storing data response;
  	UINT16 dummy_CRC;      					// Dummy variable for storing CRC field;

  	card_response.i = 0;						  
    	                                  
  	current_command = command_list[nCmd];// Retrieve desired command table entry
											// from code space;
	if(current_command.command_byte & 0x80)	// Detect ACMD
	{
		if(MMC_Command_Exec(APP_CMD,EMPTY,EMPTY,response)==FALSE)//Send APP_CMD
			return FALSE;
	}


  	SPI_SetSS(SPI1, SPI_SS0);	// CS = 0
  	SingleWrite(0xFF);
  	SingleWrite((current_command.command_byte | 0x40)&0x7f);
	DBG_PRINTF("CMD:%d,",current_command.command_byte&0x7f);

  	long_arg.l = nArg;              	// Make argument byte addressable;
                                      		// If current command changes block
                                      		// length, update block length variable
                                      		// to keep track;
		                                    // Command byte = 16 means that a set
		                                    // block length command is taking place
		                                    // and block length variable must be
		                                    // set;
  	if(current_command.command_byte == 16) 
	{current_blklen = nArg;} 
                                       // Command byte = 9 or 10 means that a
                                       // 16-byte register value is being read
                                       // from the card, block length must be
                                       // set to 16 bytes, and restored at the
                                       // end of the transfer;
  	if((current_command.command_byte == 9)||(current_command.command_byte == 10)) 
  	{
    	old_blklen = current_blklen;     // Command is a GET_CSD or GET_CID,
    	current_blklen = 16;             // set block length to 16-bytes;
  	}
                                       // If an argument is required, transmit
                                       // one, otherwise transmit 4 bytes of
                                       // 0x00;
  	if(current_command.arg_required == YES)
  	{
		dummy_CRC.i = GenerateCRC((current_command.command_byte | 0x40), 0x1200, 0);
    	for(counter=3;counter>=0;counter--) 
		{
			SingleWrite(long_arg.b[counter]);
			dummy_CRC.i = GenerateCRC(long_arg.b[counter], 0x1200, dummy_CRC.i);

