xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Libs/SDCARDLIB/SDCard.c
		}
		dummy_CRC.i = (dummy_CRC.i >> 8)| 0x01;
		SingleWrite(dummy_CRC.b[0]);
  	} else 
	{
    	counter = 0;
    	while(counter <= 3) 
		{
    		SingleWrite(0x00);
			counter++;
		}
		SingleWrite(current_command.CRC);
  	}
	
											// The command table entry will indicate
                                       		// what type of response to expect for
                                       		// a given command;  The following 
                                       		// conditional handles the MMC response;
	if(current_command.response == R1)  	// Read the R1 response from the card;
	{
  		loopguard=0;
    	do{
			card_response.b[0] = SingleWrite(0xFF);
      		if(!++loopguard) break;
    	}while((card_response.b[0] & BUSY_BIT));
		DBG_PRINTF("R1:0x%x, counter:%d\n",card_response.b[0],loopguard);
		if(!loopguard){BACK_FROM_ERROR;}
		*response=card_response.b[0];
    }                                     
    else if(current_command.response == R1b)// Read the R1b response; 
	{
    	loopguard = 0;	
      	do {
			card_response.b[0] =  SingleWrite(0xFF);
			if(!++loopguard) break;
      	}while((card_response.b[0] & BUSY_BIT));
		while((SingleWrite(0xFF)&0xFF) == 0x00);
	}
	else if(current_command.response == R2) 
	{
    	loopguard=0;
      	do{
		    card_response.b[0] = SingleWrite(0xFF);
        	if(!++loopguard) break;
      	}while((card_response.b[0] & BUSY_BIT));
	    card_response.b[1] = SingleWrite(0xFF);
		DBG_PRINTF("R2:0x%x, counter:%d\n",card_response.i,loopguard);
		if(!loopguard) { BACK_FROM_ERROR; }
		*response=card_response.i;		
    }else if(current_command.response == R3)  
	{                               // Read R3 response;
    	loopguard=0;
      	do {
        	card_response.b[0] = SingleWrite(0xFF);
		    if(!++loopguard) break;
      	} while((card_response.b[0] & BUSY_BIT));
  		DBG_PRINTF("R3:0x%x, counter:%d\n",card_response.b[0],loopguard);
  	  	if(!loopguard) { BACK_FROM_ERROR; }
      	counter = 0;
      	while(counter <= 3)              // Read next three bytes and store them
      	{                                // in local memory;  These bytes make up
        	counter++;                    // the Operating Conditions Register
	      	*pchar++ = SingleWrite(0xFF);
	    }
		*response=card_response.b[0];
    }else  
	{                               // Read R7 response;
    	loopguard=0;
      	do {
        	card_response.b[0] = SingleWrite(0xFF);
		    if(!++loopguard) break;
      	} while((card_response.b[0] & BUSY_BIT));
  		DBG_PRINTF("R7:0x%x, counter:%d\n",card_response.b[0],loopguard);
  	  	if(!loopguard) { BACK_FROM_ERROR; }
      	counter = 0;
      	while(counter <= 3)              // Read next three bytes and store them
      	{                                // in local memory;  These bytes make up
        	counter++;                    // the Operating Conditions Register
	      	*pchar++ = SingleWrite(0xFF);
	    }
		*response=card_response.b[0];
    }


	switch(current_command.trans_type)  // This conditional handles all data 
    {                                   // operations;  The command entry
                                       // determines what type, if any, data
                                       // operations need to occur;
		case RDB:                         // Read data from the MMC;
  			loopguard = 0;

	     	while((SingleWrite(0xFF)&0xFF)!=START_SBR) 
			{
    	  		if(!++loopguard) {BACK_FROM_ERROR;}
				SYS_Delay(1);
	      	}		
          	counter = 0;                  	// Reset byte counter;
                                       		// Read <current_blklen> bytes;

			SPI1->TX0 = 0xFFFFFFFF;
			if(pchar)
			{
				SPI_SetBitLength(SPI1, 8);
				SPI_SetFIFOMode(SPI1, TRUE, 2);
				SPI_FIFOReadWrite8(SPI1, NULL, pchar, current_blklen);
				
				SPI_SetFIFOMode(SPI1, FALSE, 2);
			}else
			{
				for (; counter<current_blklen; counter++)
				{ 
					SPI_SetGo(SPI1);
					while(SPI_IsBusy(SPI1));									
				}
			}
           	dummy_CRC.b[1] = SingleWrite(0xFF);	// After all data is read, read the two
           	dummy_CRC.b[0] = SingleWrite(0xFF);	// CRC bytes;  These bytes are not used
                               					// in this mode, but the placeholders 
                   								// must be read anyway;			      
          	break;
		case RD:                         // Read data from the MMC;
  			loopguard = 0;

	     	while((SingleWrite(0xFF)&0xFF)!=START_SBR) 
			{
    	  		if(!++loopguard) {BACK_FROM_ERROR;}
	      	}		
          	counter = 0;                  	// Reset byte counter;
                                       		// Read <current_blklen> bytes;
			if(pchar)
			{
				for (counter=0; counter<current_blklen; counter++)
				{ 
					SPI1->TX0 = 0xFF;
					SPI_SetGo(SPI1);
					while(SPI_IsBusy(SPI1));
					*(pchar+counter)=SPI1->RX0;										
				}
			}else
			{
				for (counter=0; counter<current_blklen; counter++)
				{ 
					SPI1->TX0 = 0xFF;
					SPI_SetGo(SPI1);
					while(SPI_IsBusy(SPI1));								
				}
			}
           	dummy_CRC.b[1] = SingleWrite(0xFF);	// After all data is read, read the two
           	dummy_CRC.b[0] = SingleWrite(0xFF);	// CRC bytes;  These bytes are not used
                               					// in this mode, but the placeholders 
                   								// must be read anyway;			      
          	break;

		case WR: 			
			SingleWrite(0xFF);
			SingleWrite(START_SBW);
          
			for (counter=0; counter<current_blklen; counter++)
			{
				SPI1->TX0 = *(pchar+counter);
				SPI_SetGo(SPI1);
				dummy_CRC.i = GenerateCRC(*(pchar+counter), 0x1021, dummy_CRC.i);				
				while(SPI_IsBusy(SPI1));
			}
			SingleWrite(dummy_CRC.b[1]);
			SingleWrite(dummy_CRC.b[0]);
	
        	loopguard = 0;
	        do                            // Read Data Response from card;
	        {  
	          	data_resp = SingleWrite(0xFF);
	          	if(!++loopguard) break;
	        }while((data_resp & DATA_RESP_MASK) != 0x01);	// When bit 0 of the MMC response
	                                       					// is clear, a valid data response
	                                       					// has been received;
	        
