xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Libs/SDCARDLIB/SDCard.c
	        if(!loopguard) { BACK_FROM_ERROR; }


	        while((SingleWrite(0xFF)&0xFF)!=0xFF);//Wait for Busy
			SingleWrite(0xFF);	        
	        break;
		default: break;
	}
    SPI_ClrSS(SPI1, SPI_SS0);	// CS = 1
    if((current_command.command_byte == 9)||(current_command.command_byte == 10)) {
    	current_blklen = old_blklen;    
	}
    return TRUE;
}
/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 MMC_FLASH_Init                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               None                                                                                      */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               None                                                                                      */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to initialize the flash card                                        */
/*---------------------------------------------------------------------------------------------------------*/
void MMC_FLASH_Init(void)
{
	uint32_t response;
	uint16_t loopguard;
  	uint32_t i;
  	uint8_t counter = 0;    		
  	uint8_t pchar[16];         		// Data pointer for storing MMC 
  	uint32_t c_size,bl_len;
  	uint8_t c_mult;


	Is_Initialized = 0;


	SPI_ClrSS(SPI1, SPI_SS0);	// CS = 1
	SYS_Delay(1000);
	//--------------------------------------------------------
	//	Send 74 SD clcok in SD mode for Toshiba SD Card
	//--------------------------------------------------------	
  	for(counter = 0; counter < 10; counter++) {
    	SingleWrite(0xFF);
  	}
	SYS_Delay(1000);

  	SPI_SetSS(SPI1, SPI_SS0);  // CS = 0		
	while(MMC_Command_Exec(GO_IDLE_STATE,EMPTY,EMPTY,&response)==FALSE)
		SYS_Delay(1000);
  	if(response!=0x01)
		return;

	if(MMC_Command_Exec(SEND_IF_COND,0x15A,pchar,&response) && response==1)
	{/* SDC ver 2.00 */
		if (pchar[2] == 0x01 && pchar[3] == 0x5A) 
		{	/* The card can work at vdd range of 2.7-3.6V */
			loopguard=0;
			do
			{
				MMC_Command_Exec(SD_SEND_OP_COND,0x40000000,EMPTY,&response);//Enable HCS(OCR[30])
				if(!++loopguard) break;
				SYS_Delay(0x100);
			}while(response!=0);
			if(!loopguard) 
				return;

			MMC_Command_Exec(READ_OCR,EMPTY,pchar,&response);
			SDtype=(pchar[0]&0x40)?SDv2|SDBlock:SDv2;
		}
	}else
	{/* SDv1 or MMCv3 */
		 MMC_Command_Exec(SD_SEND_OP_COND,0x00,EMPTY,&response);
		if (response <= 1) 
		{
			loopguard=0;
			do
			{
				MMC_Command_Exec(SD_SEND_OP_COND,0x00,EMPTY,&response);
				if(!++loopguard) break;
				SYS_Delay(50);
			}while(response!=0);
			if(!loopguard) 
				return;
			SDtype=SDv1;	/* SDv1 */
		} else 
		{
			loopguard=0;
			do
			{
				MMC_Command_Exec(SEND_OP_COND,0x00,EMPTY,&response);
				if(!++loopguard) break;
				SYS_Delay(50);
			}while(response!=0);
			if(!loopguard) 
				return;
			SDtype=MMCv3;	/* MMCv3 */
		}
		MMC_Command_Exec(SET_BLOCKLEN,(uint32_t)PHYSICAL_BLOCK_SIZE,EMPTY,&response);
	}
	if(MMC_Command_Exec(SEND_CSD,EMPTY,pchar,&response)==FALSE)
		return;

  	if(response==0) 
	{
    	DBG_PRINTF("Change speed:");
    	for(i=0;i<16;i++) {	DBG_PRINTF("0x%X ",pchar[i]);}

  	} else {
    	DBG_PRINTF("CARD STATUS 0x%X:\n",response);
  		for(i=0;i<16;i++) {	DBG_PRINTF("0x%X ",pchar[i]);}
    	LogicSector=0;
    	return;
  	}

 	if(SDtype&SDBlock)// Determine the number of MMC sectors;
	{
		bl_len = 1 << (pchar[5] & 0x0f) ;
		c_size = ((pchar[7] & 0x3F) << 16) |(pchar[8] << 8) | (pchar[9]);
		LogicSector=c_size*((512*1024)/bl_len);
	}else
	{
	  	bl_len = 1 << (pchar[5] & 0x0f) ;
  		c_size = ((pchar[6] & 0x03) << 10) |(pchar[7] << 2) | ((pchar[8] &0xc0) >> 6);
  		c_mult = (((pchar[9] & 0x03) << 1) | ((pchar[10] & 0x80) >> 7));
		LogicSector=(c_size+1)*(1 << (c_mult+2))*(bl_len/512);
  	}                                     
		DBG_PRINTF("\nLogicSector:%d, PHYSICAL_SIZE:%dMB\n",LogicSector,(LogicSector/2/1024));

  	loopguard = 0;
  	while((MMC_Command_Exec(READ_SINGLE_BLOCK,0,0,&response)==FALSE)) {
    	if(!++loopguard) break;
  	} 
  	Is_Initialized = 1;
}					  
/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 SDCARD_Open                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               None                                                                                      */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               E_DRVSDCARD_INITIAL_FAIL    Intial SDCARD Failed                                          */
/*               E_SUCCESS			         Success                                                       */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to Open GPIO function and intial SDCARD                             */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t SDCARD_Open(void)
{
	uint32_t Temp[2];
	SPI_DATA_T conf;
	
