xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Libs/SDCARDLIB/SDCard.c
	Temp[0]=0xFFFFFFFF;
	Temp[1]=0xFFFFFFFF;
            
    /* Set SPI1 pin, GPB0->MOSI0, GPB1->MISO0; GPB2->CLK, GPB3->SS0 */
    GCR->PB_L_MFP = GCR->PB_L_MFP & ~0x0000ffff|0x00003333;
    
    //select SPI1 clock source is from PLL
    CLK->CLKSEL2 = (CLK->CLKSEL2 & CLK_CLKSEL2_SPI1_MASK) | CLK_CLKSEL2_SPI1_PLL;
    
    SPI_Init(SPI1);
	
	/* Configure SPI0 as a master, 32-bit transaction*/
	conf.u32Mode = SPI_MODE_MASTER;
	conf.u32Type = SPI_TYPE0;
	conf.i32BitLength = 8;	
	SPI_Open(SPI1, &conf);	
	
	SPI_DisableAutoSS(SPI1);
	SPI_SetSlaveSelectActiveLow(SPI1);
	SPI_SetMSBEndian(SPI1);
	SPI_SetTxRegister(SPI1,Temp,2);
	
	SPI_SetClockFreq(SPI1,300000,0);
	DBG_PRINTF("Now, SPI is running at %d Hz\n", SPI_GetClock1Freq(SPI1));	
	
	MMC_FLASH_Init();
    SYS_Delay(3000);	

	if (Is_Initialized)
	{
		printf/*DBG_PRINTF*/("SDCARD INIT OK\n\n");		
	}
	else
	{
	 	printf/*DBG_PRINTF*/("SDCARD INIT FAIL\n\n");
		return 1;
	}
		
	SPI_SetClockFreq(SPI1,24000000,0);
	DBG_PRINTF("Now, SPI is running at %d Hz\n", SPI_GetClock1Freq(SPI1));
	
	return E_SUCCESS;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 SDCARD_Close                                                                           */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               None                                                                                      */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               None		                                                                               */
/*               			                                                                               */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to close SDCARD                                                     */
/*---------------------------------------------------------------------------------------------------------*/
void SDCARD_Close(void)
{
	SPI_Close(SPI1);
}
/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 SDCARD_GetCardSize                                                                     */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               PUINT32 pu32TotSecCnt                                                                     */
/*               			                                                                               */
/* Returns:                                                                                                */
/*               TRUE	The size is already saved in arg1                                                  */
/*               FALSE	The size is zero                                                                   */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to get card total sector after SDCARD is opened                     */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t SDCARD_GetCardSize(uint32_t* pu32TotSecCnt)
{
	if (LogicSector == 0)
		return FALSE;
	else 
		*pu32TotSecCnt = LogicSector;

	return TRUE;
}
/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 GetLogicSector                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               None                                                                                      */
/*               			                                                                               */
/* Returns:                                                                                                */
/*               The Logic Sector size                                                                     */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to get card total sector after SDCARD is opened                     */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t GetLogicSector(void)
{
	return LogicSector;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 SpiRead                                                                                   */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               uint32_t addr		Set start address for LBA                                              */
/*               uint32_t size      Set data size (byte)                                                   */
/*               uint32_t buffer    Set buffer pointer                                                     */
/*																		                                   */
/* Returns:                                                                                                */
/*               SDCARD Library Version                                                                    */
/*               			                                                                               */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to Get data from SD card                                            */
/*---------------------------------------------------------------------------------------------------------*/
void SpiRead(uint32_t addr, uint32_t size, uint8_t* buffer)
{
    /* This is low level read function of USB Mass Storage */
	uint32_t response;
	if(SDtype&SDBlock)
	{
		while(size >= PHYSICAL_BLOCK_SIZE)
		{
			MMC_Command_Exec(READ_SINGLE_BLOCK,addr,buffer,&response);
			addr   ++;
			buffer += PHYSICAL_BLOCK_SIZE;
			size  -= PHYSICAL_BLOCK_SIZE;
		}

