xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Libs/SDCARDLIB/SDCard.c
	}else
	{
		addr*=PHYSICAL_BLOCK_SIZE;
		while(size >= PHYSICAL_BLOCK_SIZE)
		{
			MMC_Command_Exec(READ_SINGLE_BLOCK,addr,buffer,&response);
			addr   += PHYSICAL_BLOCK_SIZE;
			buffer += PHYSICAL_BLOCK_SIZE;
			size  -= PHYSICAL_BLOCK_SIZE;
		}
	}
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: 	 SpiWrite                                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               uint32_t addr		Set start address LBA                                                  */
/*               uint32_t size      Set data size (byte)                                                   */
/*               uint32_t buffer    Set buffer pointer                                                     */
/*																		                                   */
/* Returns:                                                                                                */
/*               SDCARD Library Version                                                                    */
/*               			                                                                               */
/*                                                                                                         */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to store data into SD card                                          */
/*---------------------------------------------------------------------------------------------------------*/
void SpiWrite(uint32_t addr, uint32_t size, uint8_t* buffer)
{
	uint32_t response;
	if(SDtype&SDBlock)
	{
		while(size >= PHYSICAL_BLOCK_SIZE)
		{
			MMC_Command_Exec(WRITE_BLOCK,addr,buffer,&response);
			addr   ++;
			buffer += PHYSICAL_BLOCK_SIZE;
			size  -= PHYSICAL_BLOCK_SIZE;
		}
	}else
	{
		addr*=PHYSICAL_BLOCK_SIZE;
		while(size >= PHYSICAL_BLOCK_SIZE)
		{
			MMC_Command_Exec(WRITE_BLOCK,addr,buffer,&response);
			addr   += (PHYSICAL_BLOCK_SIZE);
			buffer += PHYSICAL_BLOCK_SIZE;
			size  -= PHYSICAL_BLOCK_SIZE;
		}
	}
}

/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/


